Repository: bemot/gogandmagog
Catalog: translation/translation-omegat.tmx
Source language: en_us
Languages: uk

source: But first let's start out here in Revelation chapter 20.
uk: Але спочатку давайте почнемо тут, у 20-му розділі Об’явлення.

source: But he's missing the most important thing which is just picking up the Bible and reading it, right?
uk: Але він упускає найголовніше, а саме взяти Біблію в руки та прочитати її, чи не так?

source: But if we're gonna put our pre-trib glasses on or our Zionist glasses, or if we're gonna go down to the Christian bookstore and see what the TV preachers and the televangelists have to say about this passage, here's what they're gonna say.
uk: Але якщо ми збираємося надіти наші окуляри перед племенем або наші сіоністські окуляри, або якщо ми збираємось сходити до християнського книжкового магазину та подивитися, що телевізійні проповідники та телепроповідники мають сказати про цей уривок, ось що вони знову скажу.

source: But if you actually just read your Bible, you'll never come up with crazy stuff like that.
uk: Але якщо ви просто читаєте свою Біблію, ви ніколи не придумаєте подібних божевільних речей.

source: But if you read carefully back in chapters 38 and 39, he also sends fire in some other places and devours some other enemies, the ones who stayed behind but had the same attitude or were part of the war machine.
uk: Але якщо ви уважно прочитаєте назад у розділах 38 і 39, він також посилає вогонь у деяких інших місцях і пожирає деяких інших ворогів, тих, хто залишився, але мав таке ж ставлення або був частиною бойової машини.

source: But ironically, this burning the weapons seven months is one of the biggest proofs why that would be ridiculous because why would you burn your weapons when you, but you're going to need that weapon boy for the next seven years.
uk: Але за іронією долі, це спалювання зброї протягом семи місяців є одним із найбільших доказів того, чому це було б смішно, тому що навіщо вам спалювати свою зброю, коли ви, але вам знадобиться цей хлопчик-зброяр протягом наступних семи років.

source: But it does make sense if it's after the millennium that just all different diversity of people are gonna be rebelling against the Lord.
uk: Але це має сенс, якщо після тисячоліття всі різні люди повстатимуть проти Господа.

source: But it left behind, Gog and Magog is the first order of business, why?
uk: Але це залишилося позаду, Гог і Маґог — це перший порядок роботи, чому?

source: But it takes about 15 minutes a day to read through the Bible in a year.
uk: Але щоб прочитати Біблію за рік, потрібно близько 15 хвилин на день.

source: But just have some kind of a plan where you're checking them off to make sure you plow through Ezekiel, you plow through Leviticus, et cetera.
uk: Але просто майте якийсь план, за яким ви відмічаєте їх, щоб переконатися, що ви прочитаєте Єзекіїля, ви прочитаєте Левіт тощо.

source: But remember those three little words that were just kind of plugged in there, Gog and Magog.
uk: Але запам’ятайте ці три маленькі слова, які були просто включені туди, Гог і Магог.

source: But that comes down on them, and then also fire and brimstone, brimstone would be like a sulfur, like hellfire basically.
uk: Але це падає на них, а потім також вогонь і сірка, сірка буде як сірка, як пекельний вогонь.

source: But that's not really what it says.
uk: Але насправді це не те, що там сказано.

source: But the big sticking point for them is that they have this idea that immediately when the millennium ends, that just immediately you go to the great white throne and immediately you have the new heaven and the new earth.
uk: Але головний камінь спотикання для них полягає в тому, що вони мають таку ідею, що відразу ж, коли закінчиться тисячоліття, ви відразу ж підете до великого білого престолу, і відразу у вас з’являться нове небо і нова земля.

source: But there were a lot of people that were saved before the time of Christ, right?
uk: Але було багато людей, які були врятовані до часів Христа, чи не так?

source: But there's a buildup.
uk: Але є накопичення.

source: But these prophecy teachers, oh this Gog and Magog is all setting up right now.
uk: Але ці вчителі пророцтв, о, ці Ґоґ і Маґог усе це зараз створюють.

source: But think about this.
uk: Але подумайте про це.

source: But we know this was a miracle.
uk: Але ми знаємо, що це було диво.

source: But what if we were to apply this today?
uk: Але що, якби ми застосували це сьогодні?

source: But what's funny is that what I just explained to you, what I just taught you, this is not what the typical teaching of Ezekiel 37.
uk: Але що смішно, це те, що я щойно пояснив вам, чого я щойно навчив вас, це не те, що є типовим вченням Єзекіїля 37.

source: But when Tim LaHaye explains it, it makes sense, the way he breaks it down, why?
uk: Але коли Тім ЛаХей пояснює це, це має сенс, як він розбиває це, чому?

source: But when that trumpet sounds and the dead in Christ rise first, that's when David's body is gonna be resurrected.
uk: Але коли ця сурма засурмить і мертві у Христі воскреснуть першими, саме тоді тіло Давида воскресне.

source: But when you actually comprehend that for a second, it actually ends up proving the post-trib pre-wrath non-Zionist point of view.
uk: Але коли ви насправді це усвідомлюєте на секунду, це фактично закінчується підтвердженням несіоністської точки зору після племені до гніву.

source: But when you go into the new heaven and the new earth, it's perfect.
uk: Але коли ви йдете на нове небо і нову землю, це ідеально.

source: But who knows, maybe it's gonna take five months, but that seems too short.
uk: Але хто знає, можливо, це займе п’ять місяців, але це здається занадто коротким.

source: But you say, oh, I'll listen to preaching.
uk: Але ви говорите: о, я буду слухати проповідь.

source: But, you know, let's grow up and let's read the whole Bible.
uk: Але, знаєте, давайте виростемо і прочитаємо всю Біблію.

source: But, you know, to people who don't read the Bible, you can pretty much get them to believe anything.
uk: Але, знаєте, людей, які не читають Біблії, ви можете змусити повірити у що завгодно.

source: Can you imagine the looting when the whole place is on fire and all this cataclysm power outages everywhere?
uk: Чи можете ви уявити мародерство, коли все горить, і весь цей катаклізм скрізь відключено електроенергію?

source: Chapter 39, verse one says, Therefore thou, son of man, prophesy against Gog, and say, Thus saith the Lord, build I'm against thee, O Gog, the chief prince of Meshach and Tubal, and I will turn thee back, and leave but the sixth part of thee, and will cause thee to come up from the north parts, and will bring thee upon the mountains of Israel.
uk: У першому вірші розділу 39 сказано: «Тому ти, сину людський, пророкуй проти Ґоґа та скажи: Так говорить Господь, будуй, Я проти тебе, о Ґоґе, головний князе Мешаха й Тувала, і Я поверну тебе назад». , і залишить лише шосту частину себе, і підніме тебе з північних сторін, і приведе тебе на гори Ізраїля.

source: David is not ascended into the heavens.
uk: Давид не вознісся на небо.

source: Dead bodies come out of the graves, they go dwell in the land, Jesus Christ rules over them.
uk: Мертві тіла виходять із гробів, вони йдуть жити на землі, Ісус Христос панує над ними.

source: Did they come out of the graves in 1948?
uk: Чи вилазили з могил у 1948 році?

source: Did they come?
uk: Вони прийшли?

source: Did they have David as their king?
uk: Чи Давид був їхнім царем?

source: Do that while you drive.
uk: Робіть це під час водіння.

source: Do that while you eat breakfast.
uk: Робіть це під час сніданку.

source: Do that while you eat lunch.
uk: Зробіть це під час обіду.

source: Do that while you're brushing your teeth.
uk: Робіть це, поки чистите зуби.

source: Do that while you're in the shower.
uk: Зробіть це, поки ви в душі.

source: Do they believe in Jesus?
uk: Чи вірять вони в Ісуса?

source: Do they have that one shepherd?
uk: Є в них той один пастух?

source: Do you think Ethiopia is about ready to make some kind of an attack on Israel right now?
uk: Як ви думаєте, чи готова Ефіопія зараз напасти на Ізраїль?

source: Does everybody understand so far?
uk: Поки що всі зрозуміли?

source: Doesn't it make sense that at that point, you'd say like, well, we don't need these weapons.
uk: Хіба не має сенсу, що в цей момент ви сказали б, ну, ця зброя нам не потрібна.

source: Don't skip Ezekiel, don't skip Jeremiah, don't skip Isaiah, read that thing cover to cover.
uk: Не пропускайте Єзекіїля, не пропускайте Єремію, не пропускайте Ісаю, прочитайте цю річ від початку до кінця.

source: Don't they go in and throw a brick through Best Buy and walk in and they're coming out with DVD players and they're coming out with all the technology, the flat screen TV.
uk: Хіба вони не заходять і не кидають цеглину в Best Buy і не заходять, і вони виходять з DVD-програвачами, і вони виходять з усіма технологіями, телевізором з плоским екраном.

source: End Times Bible Prophecy in Ezekiel is the title of the sermon.
uk: Біблійне пророцтво кінця часів у Єзекіїля — це назва проповіді.

source: Even though Jesus had not come because the Bible says that Christ is the Lamb of God slain from the foundation of the world, okay?
uk: Навіть незважаючи на те, що Ісус не приходив, тому що Біблія говорить, що Христос є Агнцем Божим, заколеним від заснування світу, добре?

source: Every man's sword shall be against his brother.
uk: Меч кожного на брата його.

source: Every year, read your Bible cover to cover.
uk: Щороку читайте свою Біблію від початку до кінця.

source: Ezekiel and he gives us that clue by saying those three words, Gog and Magog.
uk: Єзекіїль і він дає нам цю підказку, вимовляючи ці три слова, Гог і Магог.

source: Father, we thank you so much for your word, Lord, and we thank you so much for all the wonderful things that you teach us, and that no matter how old we get, and no matter how many times we read the Bible, or how many times we go to church, we can always learn new things, because there's so much there for us, we'll never learn it all.
uk: Батьку, ми дуже вдячні Тобі за Твоє слово, Господи, і ми дуже вдячні Тобі за всі чудові речі, яких Ти навчаєш нас, і що незалежно від того, скільки ми старіємо, і незалежно від того, скільки разів ми читаємо Біблію, або скільки разів ми ходимо до церкви, ми завжди можемо навчитися нового, тому що там так багато для нас, ми ніколи не навчимося всього.

source: Forget Isaiah, give me 1st and 2nd Timothy.
uk: Забудьте про Ісаю, дайте мені 1-й і 2-й Тимофію.

source: Forget Jeremiah, give me Proverbs.
uk: Забудь Єремію, дай мені Притчі.

source: Friendly fire, right?
uk: Дружній вогонь, так?

source: Get some details about Gog and Magog.
uk: Отримайте деякі подробиці про Гога та Магога.

source: Give me a practical application.
uk: Дайте мені практичне застосування.

source: Give me something that I can use this week.
uk: Дайте мені щось, що я зможу використовувати цього тижня.

source: Go back and read 38 and 39 of Ezekiel.
uk: Поверніться назад і прочитайте 38 і 39 Єзекіїля.

source: Go back to Ezekiel 37.
uk: Поверніться до Єзекіїля 37.

source: God just decisively wins the battle by raining fire and brimstone out of heaven.
uk: Бог просто рішуче виграє битву, проливаючи з неба вогонь і сірку.

source: God miraculously caused two sticks to just merge into one stick.
uk: Бог чудесним чином зробив так, що дві палиці просто злилися в одну.

source: God rains fire from heaven and destroys them.
uk: Бог ллє вогонь з неба і знищує їх.

source: God wiped out the enemy.
uk: Бог знищив ворога.

source: Gog and Magog, just the battle of Gog.
uk: Гог і Магог, просто битва Гога.

source: He said that in the regeneration, which is another word for the resurrection or coming back to life after the rapture, he said in the regeneration, the 12 apostles would sit on 12 thrones, judging the 12 tribes of Israel.
uk: Він сказав, що під час відродження, яке є іншим словом для воскресіння або повернення до життя після захоплення, він сказав, що під час відродження 12 апостолів сидітимуть на 12 престолах, судячи 12 колін Ізраїлю.

source: He says, I'll smite the bow out of thy left hand, verse three, and will cause thine arrows to fall out of thy right hand.
uk: Він каже: «Виб’ю лука з твоєї лівої руки», вірш третій, і випаду твої стріли з твоєї правої руки.

source: He sends fire in the aisles of them dwelling at ease as well.
uk: Він також посилає вогонь у проходи, де вони мешкають спокійно.

source: He summed up a thousand years in a couple of verses.
uk: Він підсумував тисячу років у кількох віршах.

source: He would confound them, and they would, now this happens in war, what's it called?
uk: Він би їх збентежив, а вони б, тепер таке буває на війні, як це називається?

source: He would send a spirit of confusion where they would get confused and start slaughtering each other.
uk: Він посилав би духа замішання, де вони збивалися з пантелику і починали вбивати один одного.

source: He'll leave the sixth part.
uk: Він покине шосту частину.

source: He's gonna gather these nations against, let me just read it, I don't wanna quote it wrong, I'm just gonna quickly turn there in Revelation 20 to get the exact wording, I don't wanna butcher it here, it says that he will go out into the Four Quarters of the Earth to deceive the nations which are in the Four Quarters of the Earth, Gog and Magog, to gather them together to battle.
uk: Він збирається збирати ці народи проти, дозвольте мені просто прочитати це, я не хочу цитувати це неправильно, я просто швидко перейду туди в Одкровення 20, щоб отримати точне формулювання, я не хочу різати це тут, там сказано що він вийде на Чотири Чверті Землі, щоб обдурити народи, які знаходяться на Чотири Чверті Землі, Гога і Магога, щоб зібрати їх разом для битви.

source: He's gotta put these evil thoughts into their head.
uk: Він повинен втілити ці злі думки в їхні голови.

source: He's hitting the highlights.
uk: Він вражає основні моменти.

source: He's just telling us, hey, here's a rough outline.
uk: Він просто каже нам, ей, ось приблизний план.

source: He's not seeing even just bodies.
uk: Він не бачить навіть тіл.

source: He's only hitting the highlights here.
uk: Тут він виділяє лише основні моменти.

source: He's only hitting the highlights.
uk: Він виділяє лише основні моменти.

source: He's that one shepherd that's gonna rule over them.
uk: Він єдиний пастух, який правитиме над ними.

source: He's the good shepherd of Psalm 23.
uk: Він добрий пастир із Псалма 23.

source: Here's the part where people get confused.
uk: Ось та частина, де люди заплутуються.

source: Here's what doesn't make sense about that, okay?
uk: Ось що в цьому не має сенсу, гаразд?

source: Here's what he said.
uk: Ось що він сказав.

source: His body is in the grave.
uk: Його тіло в могилі.

source: How about after a thousand years of peace, right?
uk: Як щодо тисячі років миру, чи не так?

source: I don't see any country down around Ethiopia, you know, Ethiopia like African type people, black people from Ethiopia down there.
uk: Я не бачу жодної країни навколо Ефіопії, ви знаєте, Ефіопія, як люди африканського типу, чорні люди з Ефіопії там.

source: I don't see them waging an attack on Israel anytime soon, right?
uk: Я не бачу, щоб вони найближчим часом атакували Ізраїль, чи не так?

source: I don't think the hail's even really a thing here, is it?
uk: Я не думаю, що град тут справді має значення, чи не так?

source: I mean, God defeated our enemy.
uk: Я маю на увазі, що Бог переміг нашого ворога.

source: I mean, I've heard of it being what, the size of a softball, or softball-sized hail, I don't know the Guinness Book of World Records for largest hail, I would suspect it might even be bigger than that.
uk: Я маю на увазі, я чув про те, що він розміром з м’яч для софтболу або град завбільшки з м’яч для софтболу, я не знаю Книги рекордів Гіннеса щодо найбільшого граду, я підозрюю, що він навіть більший за це.

source: I mean, Israel is filled with checkpoints and soldiers and machine guns and gates and walls.
uk: Я маю на увазі, що Ізраїль наповнений блокпостами, солдатами, кулеметами, воротами та стінами.

source: I mean, he just sees very, he says these bones are very dry.
uk: Я маю на увазі, він просто бачить дуже, він каже, що ці кістки дуже сухі.

source: I mean, if you just had this giant block of ice dropped on your head, you know, let's say it's the size of a softball of just rock hard ice, and that thing just slams you in the head, or if you're just getting pummeled with baseballs of hail, I mean, that could really beat you up, right?
uk: Я маю на увазі, якби ця гігантська брила льоду щойно впала на вашу голову, ви знаєте, скажімо, вона розміром із софтм’яч просто твердого льоду, і ця штука просто вдарить вас по голові, або якщо ви просто бути побитим бейсбольними м'ячами граду, я маю на увазі, це може справді побити вас, чи не так?

source: I mean, is Benjamin Netanyahu today, is he David?
uk: Я маю на увазі, Беньямін Нетаньяху сьогодні, чи він Давид?

source: I mean, is Ethiopia some kind of a military power right now?
uk: Я маю на увазі, чи є Ефіопія зараз якоюсь військовою державою?

source: I mean, it's gonna be rough.
uk: Я маю на увазі, це буде важко.

source: I mean, it's just pretty easy to understand this chapter.
uk: Я маю на увазі, що зрозуміти цю главу досить легко.

source: I mean, it's not anything like what's being described here at all.
uk: Я маю на увазі, що це зовсім не схоже на те, що тут описано.

source: I mean, look, during the tribulation, there's major war going on in the earth.
uk: Я маю на увазі, дивіться, під час скорботи на землі точиться велика війна.

source: I mean, look, on a warm night, they'll probably just sleep outside on a warm night, right?
uk: Я маю на увазі, дивіться, теплої ночі вони, мабуть, просто спатимуть на вулиці в теплу ніч, чи не так?

source: I mean, pull up, there's a great app that you can download, the KJV-RVG, it's called.
uk: Я маю на увазі, підтягніться, є чудова програма, яку ви можете завантажити, KJV-RVG, вона називається.

source: I mean, show me any business that doesn't have some kind of a plan, some kind of a schedule, right, of what they're gonna do.
uk: Я маю на увазі, покажіть мені будь-яку компанію, яка не має якогось плану, якогось розкладу, правильно, того, що вони збираються робити.

source: I mean, that's just, that's the number one thing.
uk: Я маю на увазі, це просто, це річ номер один.

source: I mean, that's kind of just too short of a statement.
uk: Я маю на увазі, що це занадто коротке твердження.

source: I mean, the looters are gonna be going crazy.
uk: Я маю на увазі, що мародери збожеволіють.

source: I mean, they're creating a lot of weapons because remember, they're gonna be burning them for seven years as firewood.
uk: Я маю на увазі, що вони створюють багато зброї, тому що пам’ятайте, вони будуть спалювати її сім років як дрова.

source: I mean, they're just a sitting duck, no way.
uk: Я маю на увазі, вони просто сидяча качка, ні в якому разі.

source: I mean, think about how dumb that is, right?
uk: Я маю на увазі, подумайте, наскільки це тупо, чи не так?

source: I mean, wasn't there just a disaster literally a couple of months ago and looters were being busted with flat screen TVs down with this hurricane that just hit in the southern eastern part of the United States and in the Caribbean, all kinds of looting.
uk: Я маю на увазі, хіба буквально пару місяців тому не сталося лиха, і грабіжників ловили з телевізорами з плоскими екранами під час цього урагану, який щойно обрушився на південно-східну частину Сполучених Штатів і Карибського басейну, всілякі грабунки .

source: I mean, why would you just sit there and say, well, we don't need any firewood.
uk: Я маю на увазі, чому б ви просто сиділи і казали, ну, нам не потрібні дрова.

source: I really don't even have that 15 minutes.
uk: У мене навіть немає цих 15 хвилин.

source: I remember one time I went to a boss at my work and was chatting with him.
uk: Пригадую, як одного разу я зайшов до начальника на роботу й побалакав з ним.

source: I remember when I was a little kid, I read those three words, Gog and Magog, and I was like, oh, so that's stuff in Ezekiel, that's when that happens.
uk: Я пам’ятаю, коли я був маленькою дитиною, я прочитав ці три слова, Гог і Магог, і я подумав, о, так це в Єзекіїля, саме тоді це відбувається.

source: I said, listen to Bible.
uk: Я сказав, послухайте Біблію.

source: I will go to them that are at rest, that dwell safely, all of them dwelling without walls and having neither bars nor gates.
uk: Я піду до тих, що спочивають, що живуть безпечно, усі вони живуть без стін і не мають ані засувів, ані воріт.

source: I would always just go to either Psalms, Proverbs, 1st and 2nd Timothy, or I would go to the Gospels and just go straight to the red letters.
uk: Я завжди просто звертався до Псалмів, Приповістей, 1-го та 2-го Тимофія, або я переходив до Євангелія і переходив просто до червоних літер.

source: I'd read about three or four verses and then go back to the playing video games or riding my bike or swimming or what, you know.
uk: Я читав приблизно три-чотири вірші, а потім повертався до відеоігор, катання на велосипеді, плавання чи що, знаєте.

source: I'll make a covenant of peace with them, et cetera.
uk: Я укладу з ними угоду про мир і так далі.

source: I'll send a fire on Magog, and among them that dwell carelessly in the aisles, and they shall know that I am the Lord.
uk: Я пошлю вогонь на Магога та на тих, хто безтурботно живе в проходах, і вони пізнають, що Я Господь.

source: I'll show you the answer.
uk: Я покажу вам відповідь.

source: I'm learning about God.
uk: Я вчуся про Бога.

source: I'm learning about doctrine.
uk: Я вивчаю доктрину.

source: I'm sorry, let me back up.
uk: Вибачте, дозвольте зробити резервну копію.

source: If I had to guess, and obviously, we have no way of knowing this, but I would just guess that for the devil to go around and deceive everybody and to organize this battle, if I were to throw a number out, I'd say it's probably gonna take like five years, would be my guess.
uk: Якби мені довелося здогадатися, і, очевидно, ми не можемо це знати, але я б просто здогадався, що для того, щоб диявол ходив навколо, обманював усіх і організовував цю битву, якби я викинув число, я б скажімо, це займе близько п’яти років, я думаю.

source: If I look at the date and it says November 10th, I'm gonna say, hey, this is not expired.
uk: Якщо я подивлюся на дату, і там буде написано 10 листопада, я скажу, що це ще не минув.

source: If this is happening at the beginning of the tribulation as the televangelists will tell us, if this is happening around the time of the rapture as the left behind movie would show us, let me ask you this.
uk: Якщо це відбувається на початку скорботи, як розкажуть нам телеєвангелісти, якщо це відбувається приблизно під час піднесення, як покаже нам фільм, що залишився позаду, дозвольте мені запитати вас про це.

source: If this is something that's a current event, if this is something that's gonna happen any day now, if this is something that happens at the beginning of the tribulation or something that happens around the time of the rapture, could it be said of Israel today that they're just unwalled?
uk: Якщо це те, що є поточною подією, якщо це те, що станеться найближчого дня, якщо це те, що станеться на початку скорботи чи щось, що станеться приблизно під час піднесення, чи можна це сказати про Ізраїль сьогодні що вони просто незамуровані?

source: If we actually follow what it says about Jesus reigning over them, it goes straight from the millennium into Gog and Magog.
uk: Якщо ми дійсно слідуємо тому, що там сказано про Ісуса, який царював над ними, це переходить прямо від тисячоліття до Гога та Магога.
